doc/project-developing-modules.org
#+title: Flake Module (with =flake-parts=) Development Guide
#+setupfile: internal/links.org

* Org-mode setup :noexport:

** Variables

We set variables in =internal/params.el= and access those settings with the
following macros and source code blocks (using Noweb).

#+name: get
#+begin_src emacs-lisp :var arg="" :eval yes :results silent
(alist-get (intern arg) (car (read-from-string (f-read "internal/params.el"))))
#+end_src

** Formatting help

This snippet can be used as a post-processing step to crop down the results from
an evaluation of a source code block.

#+name: crop
#+begin_src emacs-lisp :var text="" :var first-n=5 :var last-n=5 :results silent
(let* ((ls         (split-string text "\n"))
       (first-ls   (-take first-n ls))
       (rest-first (-drop first-n ls))
       (rest-last  (-drop-last (+ 1 last-n) rest-first))
       (last-ls    (-take-last (+ 1 last-n) rest-first)))
  (string-join
   ;; DESIGN: org2gfm deletes Markdown, making project "dirty"
         (-filter (lambda (s) (not (s-matches? "^warning: .*is dirty$" s)))
                  (if rest-last
                      (append first-ls '("…") last-ls)
                    (append first-ls last-ls)))
   "\n"))
#+end_src

** Setup action

#+name: cleanup
#+begin_src sh :dir .. :results output silent
rm --recursive --force /tmp/my-project-more
#+end_src

* About this document

This document is a continuation of [[file:project-developing-basics.org][Flakes Basics Development Guide]].
Specifically, it explains how to use and author your own [[flake-parts][=flake-parts=]] modules,
to address some points of tension when using the plain flakes API.

* Prerequisites

Before diving into flake-parts modules, you should be familiar with the [[file:project-developing-basics.org][Flakes
Basics Development Guide]].

Additionally, the following guides may be helpful:
- [[file:nix-introduction.org][Introduction to Nix and Motivations to Use It]]
- [[file:nix-installation.org][Nix Installation and Configuration Guide]]
- [[file:nix-language.org][Introduction to the Nix Programming Language]]

* Scaffolding

If you followed the [[file:project-developing-basics.org][Flakes Basics Development Guide]], you already scaffolded a
project using the provided =less= template, which by design doesn't use
=flake-parts=.  To follow along with this guide, you can scaffold a project from
the =more= template, which illustrates usage of =flake-parts=:

#+begin_src sh :eval no
nix --refresh \
    flake new \
    --template github:shajra/nix-project/main#more \
    /tmp/my-project-more  # or whereever you want your new project
#+end_src

#+name: scaffold-more
#+begin_src sh :dir .. :results output :exports results :post crop(text=*this*, first-n=100, last-n=0)
nix --refresh \
    flake new \
    --template .#more \
    /tmp/my-project-more 2>&1
#+end_src

#+RESULTS: scaffold-more
: wrote: "/tmp/my-project-more/README.org"
: wrote: "/tmp/my-project-more/default.nix"
: wrote: "/tmp/my-project-more/flake.nix"
: wrote: "/tmp/my-project-more/nix/compat.nix"
: wrote: "/tmp/my-project-more/nix/module/my-module.nix"
: wrote: "/tmp/my-project-more/nix/module"
: wrote: "/tmp/my-project-more/nix/my-app.nix"
: wrote: "/tmp/my-project-more/nix/overlay.nix"
: wrote: "/tmp/my-project-more/nix"

Beyond what's in the =less= template, the =more= template also provides two files,
=default.nix= and =nix/compat.nix= to support end users who have decided not to
enable flakes in their Nix installation.  These are standalone, and could be
copied to any flake-based project. The provided [[file:nix-usage-noflakes.org][guide on using Nix without
flakes]] illustrates how end users without flakes can use the =default.nix= and
=nix/compat.nix= files in the scaffolded project.  The [[file:nix-usage-flakes.org][guide on using Nix with
flakes]] will match the experience of other users using flakes.

