doc/project-developing-modules.md
- [About this document](#sec-1)
- [Prerequisites](#sec-2)
- [Scaffolding](#sec-3)
- [Motivating using `flake-parts`](#sec-4)
- [Using `flake-parts`](#sec-5)
- [Authoring your own flake module](#sec-6)
  - [First understanding general Nix modules](#sec-6-1)
  - [From Nix modules to flake modules](#sec-6-2)
  - [A common flake module pattern](#sec-6-3)
- [Distributing your flake module](#sec-7)
- [Next steps](#sec-8)


# About this document<a id="sec-1"></a>

This document is a continuation of [Flakes Basics Development Guide](project-developing-basics.md). Specifically, it explains how to author [`flake-parts`](https://github.com/hercules-ci/flake-parts) modules, to address some points of tension when using the plain flakes API.

# Prerequisites<a id="sec-2"></a>

Before diving into flake-parts modules, you should be familiar with the [Flakes Basics Development Guide](project-developing-basics.md).

Additionally, the following guides may be helpful:

-   [Introduction to Nix and Motivations to Use It](nix-introduction.md)
-   [Nix Installation and Configuration Guide](nix-installation.md)
-   [Introduction to the Nix Programming Language](nix-language.md)

# Scaffolding<a id="sec-3"></a>

If you followed the [Flakes Basics Development Guide](project-developing-basics.md), you already scaffolded a project using the provided `less` template, which by design doesn't use `flake-parts`. To follow along with this guide, you can scaffold a project from the `more` template, which illustrates usage of `flake-parts`:

```sh
nix --refresh \
    flake new \
    --template github:shajra/nix-project/main#more \
    /tmp/my-project-more  # or whereever you want your new project
```

    wrote: "/tmp/my-project-more/README.org"
    wrote: "/tmp/my-project-more/default.nix"
    wrote: "/tmp/my-project-more/flake.nix"
    wrote: "/tmp/my-project-more/nix/compat.nix"
    wrote: "/tmp/my-project-more/nix/module/my-module.nix"
    wrote: "/tmp/my-project-more/nix/module"
    wrote: "/tmp/my-project-more/nix/my-app.nix"
    wrote: "/tmp/my-project-more/nix/overlay.nix"
    wrote: "/tmp/my-project-more/nix"

Beyond what's in the `less` template, the `more` template also provides two files, `default.nix` and `nix/compat.nix` to support end users who have decided not to enable flakes in their Nix installation. These are standalone, and could be copied to any flake-based project. The provided [guide on using Nix without flakes](nix-usage-noflakes.md) illustrates how end users without flakes can use the `default.nix` and `nix/compat.nix` files in the scaffolded project. The [guide on using Nix with flakes](nix-usage-flakes.md) will match the experience of other users using flakes.
