doc/project-developing-modules.org
* Motivating using =flake-parts=

As covered in the [[file:project-developing-basics.org][Flakes Basics Development Guide]], the code in our =less= template
has a few points of tension:

- The =forAllSystems= boilerplate in [[file:../examples/less/flake.nix][=flake.nix=]], while not too many lines, is
  distracting.
- Lots of dependencies in [[file:../examples/less/nix/overlay.nix][=nix/overlay.nix=]] seem to build slightly differently
  and we have to figure out how to place their results in the appropriate flake
  output.
- If not for [[file:../examples/less/config.nix][=./config.nix=]], our flake can easily seem more like complicated
  code than a declarative configuration.

The =flake-parts= project addresses these issues by leaning an abstraction
originating from the NixOS operating system called /Nix modules/.  When used in
the context of =flake-parts=, we call these modules /flake modules/.

A key observation to motivate the design of Nix modules are that our build
configurations often starting with a tree of attributes (nested attribute sets),
of an allowed schema.  Then we perform some computation that might require some
standard inputs, and end up with our tree extended with more attributes
representing our build artifacts.  Then these artifacts might become inputs for
more computations.  Iterating on this process, we keep on growing our tree until
we have what we need.

To support this pattern a Nix module encapsulate one step of such a process:
- inputs needed by all modules are defined and made available
- configuration attribute paths and types are well-specified
- the module has a transform to turn configuration to resultant paths/values
- modules can import other modules as dependencies

Let's look at [[file:../examples/more/flake.nix][the =more= template's =flake.nix=]] for a concrete example of Nix
modules as flake modules.  The flake module in this file has the following
structure:

#+begin_src nix :eval no
{ withSystem, ... }:
  …
{
  imports = [
    inputs.nix-project.flakeModules.org2gfm
    inputs.devshell.flakeModule
    inputs.treefmt-nix.flakeModule
    nix/module/my-module.nix
  ];
  systems = (import systems-darwin) ++ (import systems-linux);
  perSystem = …;
  flake = …;
}
#+end_src

Similar to the plain flakes API, we have a function that can be passed a variety
of input arguments.  And we return attributes that give us an alternate API for
defining flakes.

All of these attributes (=imports=, =systems=, =perSystem=, and =flake=) have been
defined already as valid /options/ for our module.  If we use another attribute,
or set them to values of the wrong type, the =flake-parts= API will throw an error
with a helpful message.

Much of this can be implemented with a simple callback-based API. But modules
give us some added benefits worth noting:
- Modules can import other modules to get more /options/ for new valid
  configuration attributes.
- Options can declare how configuration merges if the same configuration is set
  differently by two different imported modules.
- Options have a fairly elaborate type system helping us get nice error messages.

In summary, modules compose.  The =imports= attribute, standard to all modules is
central to composition.  For example, if we want attributes that help us
configure [[treefmt-nix][=treefmt-nix=]], we can import the [[flake-parts-doc-treefmt][=treefmt-nix= flake module]].  This
imports options for attributes we can validly set to configure our formatter:

#+begin_src nix :eval no
{ ... }:
{
  imports = [
    inputs.treefmt-nix.flakeModule
    …
  ];
  perSystem = { ... }: {
    treefmt.programs = {
      deadnix.enable = true;
      nixfmt.enable = true;
      nixf-diagnose.enable = true;
    };
    …
  };
  …
}
#+end_src

The flake module will then handle setting up useful flake outputs.  In the case
of the =treefmt-nix= flake module, by default these include:
- =formatter.<system>=, which is used by =nix fmt=
- =checks.<system>.treefmt=, so =nix flake check= asserts all our code is formatted.

These are just defaults.  You can control how the flake outputs are managed with
the =treefmt-nix= module configuration.

Each module gives us a focused custom API (you might think of them as
domain-specific languages).  These little APIs make more clear the intent of our
build, rather than having to see it through the code setting flake outputs.
Modules abstract that part away.

Note that the configuration inputs of modules in the [[file:../examples/more/flake.nix][=more= template's =flake.nix=
]]look nearly identical to the [[file:../examples/less/config.nix][=less= template's =config.nix= file]].  This is  by
pedagogical design.  You don't need to have actual modules to factor your code
in a modular style.  This is what the =less= template illustrates.

By using =flake-parts=, you get
- a little less boilerplate
- more clear modular boundaries
- and nice error checking/messages.

