doc/project-developing-modules.org
* Using =flake-parts=

To help get you started with =flake-parts=, this section covers its API at a
high-level.  You should eventually read the [[flake-parts-doc][official =flake-parts= documentation]].

The following illustrates how to call the =flake-parts= API in the =outputs=
attribute of a flake:

#+begin_src nix :eval no
{
  inputs.flake-parts.url = "github:hercules-ci/flake-parts";
  outputs =
    inputs@{self, flake-parts, ... }:
    flake-parts.lib.mkFlake { inherit inputs; } (topLevelModArgs: {
      …
    });
  …
}
#+end_src

Note that bindings we have in scope include our dependencies (bound to ~inputs~
above) and =flake-parts= top-level module arguments (bound to the ~topLevelModArgs~
attribute set above). These top-level module arguments are [[flake-parts-doc-modargs][documented fully in
the =flake-parts= documentation]].

If you don't need the top-level arguments to configure your modules, you can
call =flake-parts= with a more straightforward form (just an attribute set instead
of a function returning one):

#+begin_src nix :eval no
{
    # …
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } {
            # …
        };
}
#+end_src

As you can see from the =more= template's [[file:../examples/more/flake.nix][=flake.nix=]] file, =flake-parts= has us
populate three attributes:
- =systems=, a list of all the systems to build for
- =perSystem=, a function evaluated for each system from =systems= that returns
  system-specific output.
- =flake=, for outputs that pass through as raw flakes outputs

In practice, this looks something like the following:

#+begin_src nix :eval no
{
    # …
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } (topLevelModArgs: {
            systems = [
                # …
            ];
            perSystem = perSystemModArgs: {
                # …
            };
            flake = {
                # …
            };
        });
}
#+end_src

In =flake-parts=, the =flake= attribute is used for flake outputs that are the same
for all target systems. The =flake= component of the attribute path is dropped in
the final flake output path.  For example, in the =more= template, =flake-part='s
~flake.overlays.default~ ends up being just ~overlays.default~ in our project's
final flake output.

Otherwise, all our system-specific outputs are returned by the function we set
for the =perSystem= attribute. Notice the =perSystem= function has the following
three bindings in scope:
- the original flake inputs (~inputs~ above)
- top-level module arguments (~topLevelModArgs~ above)
- per-system module arguments (~perSystemModArgs~ above)

The per-system module arguments are also [[flake-parts-doc-modargs][documented fully in the flake-parts
documentation]]. These arguments help us avoid dealing with the system we're
targeting.

For example, one of the per-system arguments is =pkgs=. If you use this argument,
you are expected to have Nixpkgs bound as an input to the specially treated
=nixpkgs= name.

For example, let's say we wanted to pass through GNU Hello as a package provided
by our project.  Without =flake-parts= we would access the =hello= package from the
attribute path =inputs.nixpkgs.legacyPackages.<system>.hello=.  With =flake-parts='
=perSystem= API, we access it simply with =pkgs.hello=.

The following illustrates this GNU Hello example in a tiny, but complete
=flake.nix= file using =flake-parts=:

#+begin_src nix :eval no :noweb yes
{
    description = "Illustrating flake-parts";
    inputs = {
        flake-parts.url = "github:hercules-ci/flake-parts";
        nixpkgs.url = "github:NixOS/nixpkgs/nixos-<<get("nixos-latest")>>";
    };
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } {
            systems = [ "x86_64-linux" "aarch64-darwin" ];
            perSystem = { pkgs, ... }: {
                packages.my-hello = pkgs.hello;
            };
        };
}
#+end_src

Hopefully, the improvement in this API is appreciable upon inspection. We don't
have to mess with a parameterization for the system. And merging everything for
each system is done for us.

In the example above, rather than accessing the =hello= package from the
~inputs.nixpkgs~ parameter, we get it from the per-system module argument =pkgs=,
which looks for ~inputs.nixpkgs~ by name, and selects out the appropriate
=legacyPackages= for whatever system we're targeting (one of those listed in
=systems=).

Additionally, in our ~perSystem~ we set a ~packages.my-hello~ attribute, and the
final outputs we get in our flake are:
- ~packages.x86_64-linux.my-hello~
- ~packages.aarch64-darwin.my-hello~

See the [[flake-parts-doc-modargs][official flake-parts documentation]] for more per-system module arguments
available beyond =pkgs=. Particularly useful is =inputs'=, which can be traversed
just like =inputs=, but ignoring the system component of the attribute path. So,
though a little more verbose, we could use =inputs'= instead of =pkgs= as follows:

#+begin_src nix :eval no :noweb yes
{
    description = "Illustrating flake-parts";
    inputs = {
        flake-parts.url = "github:hercules-ci/flake-parts";
        nixpkgs.url = "github:NixOS/nixpkgs/nixos-<<get("nixos-latest")>>";
    };
    outputs = inputs@{ flake-parts, ... }:
        flake-parts.lib.mkFlake { inherit inputs; } {
            systems = [ "x86_64-linux" "aarch64-darwin" ];
            perSystem = { inputs', ... }: {
                packages.my-hello = inputs'.nixpkgs.legacyPackages.hello;
            };
        };
}
#+end_src

* Authoring your own flake module

Even if you enjoy and use =flake-parts=, community adoption of the project has
been partial.  While the potential is there for a large ecosystem of publicly
distributed flake modules, what we have feels useful, but far from complete.

That doesn't mean you have to abandon =flake-parts= completely.  You can mix the
styles of the =more= and the =less= templates, using flake modules when they exist
for your purpose.

However, if you really want to lean harder into =flake-parts=, you might have
motivation to author your own flake module, even if you opt not to distribute it
publicly.

