doc/project-developing-modules.org
** First understanding general Nix modules

Flake modules are a specialized instance of the more general concept of Nix
modules, originally created to configure the NixOS operating system.  This
section discusses the general form of Nix modules in preparation for subsequent
sections on the specifics of flake modules.

We're only going to cover Nix modules at a high-level.  More complete references
on the subject include
- [[nixos-manual-modules][the NixOS manual's section on modules]]
- [[nixos-wiki-modules][the NixOS wiki page on modules]].

Modules come in a few forms, ranging
- from a simple module attribute set
- to a function taking an attribute set of useful arguments and returning the
  module attribute set.

The module attribute set can also come in a few forms.  The most general form
has the following three attributes:

#+begin_src nix :eval no
{
  imports = [
    # paths to other modules
  ];
  options = {
    # properties defining the valid attribute paths and types of configuration.
  };
  config = {
    # the configuration, conforming to all options in the current or imported
    # module.
  };
}
#+end_src

If there are no options declared by a module, the following form is also valid:

#+begin_src nix :eval no
{
  imports = [
    # paths to other modules
  ];
  # the configuration, conforming to all options in imported modules.
}
#+end_src

The parameters passed to the function-form of a Nix module varies depending on
the type of module.  Common to most implementations (including flake modules)
include
- =config=, the "final" attribute set of all configuration
- =options=, the "final" attribute set of all options
- =lib=, a useful library of functions from Nixpkgs.

Notice that what to an end user looks just like configuration is actually a
module that doesn't declare any options, but rather gets all it's options
implicitly through imports.

** From Nix modules to flake modules

You can think of flake modules as normal Nix modules with some built-in modules
implicitly imported. These modules provide options for the following
configuration attributes:
- =system=
- =perSystem=
- =flake=

The =flake= configuration is special, because this is what will actually become
our final flake outputs.  It's good to exercise restraint in exposing new
outputs on a flake.  These will show up in =nix flake show=.  Too many
non-standard outputs undermines the benefit of having a standard in the first
place.

Instead, it's much more conventional to have custom configuration for a module
on =perSystem=, which are not exposed on the flake unless our module does so
explicitly (using =flake=).  This works out most of the time because most custom
build work is actually system-specific.

It's important to understand that the type of =perSystem= is a itself a module, So
with =flake-parts= we're authoring a inner module (=perSystem=) while also authoring
an outer module for the API.  All common aspects of Nix modules apply to both.
For instance, both can be simplified from a function to just an attribute set if
you don't require module arguments.

** A common flake module pattern

Since custom flake module configuration is so commonly defined on =perSystem=,
many flake modules have the following form:

#+begin_src nix :eval no
{ flake-parts, ... }:

{
  options.perSystem = flake-parts.lib.mkPerSystemOption (
    { config, lib, pkgs, ... }:
    {
      _file = ./this-module.nix
      options = {
        # Declare per-system options
      };

      config = {
        # Provide per-system configuration
      };
    }
  );
}
#+end_src

The =mkPerSystemOption= function is a wrapper that decorates our =perSystem= module
to work with =flake-parts=' documentation framework.  To have a functioning flake,
it's not strictly needed.  The =_file= attribute is also optional for
documentation purposes.

As a concrete illustration the =more= template includes a small example of a flake
module:

#+include: "../examples/more/nix/module/my-module.nix" src nix

This module introduces two per-system configuration options:
- =enable=, a boolean to turn the feature on/off
- =message=, a configurable message to echo to standard out

If the module is imported, and the feature is enabled, then a system-specific
=my-module-app= package and app are published on the flake.

To show how we might affect a non-system-specific flake output like =flakeModules=
based on the results of a per-system configuration, we self-publish the
=my-module= module, only if enabled, but we look for this enablement on
configurations for all systems (=config.allSystems=).

Note how we use =lib.mkIf= to conditionally publish the package and app on the
flake.  We need these kinds of functions, because lexically in the module, we
don't know yet if the feature is actually going to be used or not.

Also, this is the first time we're seeing how options are defined.  This example
illustrates just a small sample of available types.  See [[nixos-manual-modules][the NixOS manual
sections on modules]] for details on how expressive these types can get.

We can see this module used in the [[file:../examples/more/flake.nix][=more= template =flake.nix=]]:

#+begin_src nix :eval no
{
  imports = [
    # …
    nix/module/my-module.nix
  ];
  perSystem = {
    # …
    my-module.enable = true;
  };
  # …
}
#+end_src

* Distributing your flake module

As we've seen in the discussion above, modules are expected to be distributed on
the =flakeModules= output attribute of a flake.  This is not yet a standard in the
flakes API, but it's a convention that users of =flake-parts= have settled on.

You might see people publishing single modules on =flakeModule=, but this older
style is clearly less extensible and inconsistent with other flake
configurations (=packages=, =apps=, =overlays=, etc).  If you have only one flake
module to publish, use =flakeModules.default= instead of =flakeModule=.

* Next steps

This document has covered a lot of topics to get just a high-level explanation
of how to author flake modules.  Here's a compilation of relevant resources to
explore more:

- [[nix-wiki-flakes][The Nix wiki page on flakes]]
- [[nix-manual-flakes-inputs][The Nix manual's section on flake inputs]]
- [[flake-parts-doc][=flake-parts= documentation]]
- [[nixos-manual-modules][The NixOS manual's section on modules]]
- [[nixos-wiki-modules][The Nix wiki's page on modules]]

Beyond the example module in the =more= template, Nix-project provides [[file:../nix/module][some small
modules]] you may find instructive to look at.

* Silent tests :noexport:

#+begin_src sh :dir .. :results silent :exports none
nix run /tmp/my-project-more#default \
    --override-input nix-project path:.
#+end_src

#+name: scaffold-doc-more
#+begin_src sh :dir .. :results silent :exports none
PROJECT_ROOT=$(pwd)
cd /tmp/my-project-more
nix develop \
    --override-input nix-project "path:${PROJECT_ROOT}" \
    --command project-doc-gen
#+end_src

* Org-mode cleanup :noexport:

Cleans directory for run:

#+call: cleanup()
